import { MassageChairType } from "@/types/Types";

export const massageChairs: MassageChairType[] = [
  {
    id: 1,
    name: "BL-5",
    subTitle: "Луксузна Столица за Масажа",
    price: 2360,
    availability: false,
    colorVariants: [{colorCode: '#94F8FA', colorName: 'Сина'},{colorCode: '#DD8855', colorName: 'Дрвено Кафеава'},{colorCode: '#4C4C56', colorName: 'Црна'}],
    listItemDesc: [
      "4D манипулација - Масажа на целото тело, ролери за раце, нозе и стапала",
      "48 Воздушни Перничиња - Греење на грб до 45°C",
      "Разни масажи, брзини и интензитети",
      "Детекција на форма на тело",
      "Безжично полнење - Bluetooth - AI гласовни команди",
    ],
    gallery: {
      product: "/chairs/BL-H530/H5305_Product_Blue.png",
      headOn: "/chairs/BL-H530/h530headOn2.png",
      side: "/chairs/BL-H530/530Side2.png",
      zeroGravity: "/chairs/BL-H530/H5303Zero2.png",
      detailsHero: "/chairs/BL-H530/H5305_Product_Blue.png",
    },
    headOnIcons: ["cinema-4d.png", 'furniture.png', 'chat-bot.png', 'wireless-charging.png', 'user-interface.png'],
    headOnSubTitle: "Луксузна Столица за Масажа",
    headOnTitle: "Врвен Дизајн",
    headOnDesc:
      "Луксузната BL-5 масажна столица обезбедува највисоко ниво на релаксација и удобност со 4D манипулација за целосна масажа на телото. Воздушните перничиња се грижат за прецизна масажа на рацете и нозете, додека ролерите нудат интензивна масажа на стапалата. Загревањето на грбот до 45 степени дополнително го подобрува искуството. Столот интелигентно го детектира обликот на телото и се прилагодува за персонализирана масажа. Луксузната BL-5 масажна столица вклучува и безжично полнење, Hi-Fi Bluetooth звук и елегантен LCD екран за максимална контрола и уживање. Оваа столица е идеален избор за оние кои бараат совршена комбинација од релаксација и терапевтска масажа, со посебен акцент на целосното тело и листовите.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "20+ програми - 3 Интензитети",
    sideDesc:
      "Повеќе од 20 различни масажни функции, секоја со различни нивоа на интензитет, овозможувајќи целосно персонализирано искуство. Столот е опремен со над 48 воздушни перничиња кои обезбедуваат детална масажа на телото, додека ролерите за листови и стапала гарантираат длабока и ослободувачка масажа. Покрај тоа, функцијата за истегнување придонесува за намалување на мускулната напнатост и подобрување на флексибилноста, правејќи го овој стол совршен за целосна релаксација и терапевтско уживање.",
    sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-5 столицата за масажа е идеален избор за оние кои бараат совршена комбинација од релаксација и терапевтска масажа, со посебен акцент на целосното тело и листовите.",
        info2:
          "Со повеќе од 20 масажни функции, прецизна масажа, истегнување и Zero Gravity функцијата, како и компактни димензии и современи технологии како безжично полнење и Bluetooth го прават идеален за секој дом.",
          info3: "BL-5 столицата за мазажа е достапна по нарачка во следниве варијанти односно бои: Сина, Дрвено-Кафеава и Црна.",
          info4: "Цена: 2,360.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 184cm x 77cm x 83cm",
          "Моторни делови: 11",
          "Воздушни перничиња: 48",
          "Материјали: Вештачка Кожа",
          "Тежина: 118кг",
          "Електричен напој: 150W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "20+ Програми",
          "3 Интензитети",
          "Греење на грб - 45°C",
          "Ролери за листови и стапала",
          "Stretch режим",
          "Zero Gravity",
          "Airbags",
          "Tuina Масажа",
          "Скенирање на рамениците и телото",
        ],
      },
    },
  },
  {
    id: 2,
    name: "Vending",
    subTitle: "Комерцијална Столица за Масажа",
    price: 2180,
    availability: true,
    colorVariants: [{colorCode: '#4C4C56', colorName: 'Црна'}],
    listItemDesc: [
      "4D манипулација - Масажа на целото тело",
      "10 модови - 3 интензитети",
      "Греење на грб до 45°C",
      "Работа на Токен",
      "20 Airbags - Zero Gravity",
      "Детекција на форма на тело",
    ],
    gallery: {
      product: "/chairs/Vending/vending_Product_Original.png",
      headOn: "/chairs/Vending/vending_front.png",
      side: "/chairs/Vending/vending_side_Image.png",
      zeroGravity: "/chairs/Vending/vending_gravity (1).png",
      detailsHero: "/chairs/Vending/vending_Details.png",
    },
    headOnIcons: ["cinema-4d.png", 'furniture.png', 'token.png', 'usb.png', 'person.png'],
    headOnSubTitle: "Масажна Столица за Комерцијална употреба",
    headOnTitle: "Врвен Дизајн",
    headOnDesc:
      "Автоматскиот масажен стол за комерцијална употреба е идеален за различни јавни простори. Овaa столица располага со воздушни перничиња за рамена, грб, раце и листови и нуди три нивоа за зголемување на интензитетот на масажата. Се прилагодува на телесната големина на корисникот и го регулира аголот на потпирачот за грб. Дополнително на располагање ви стои и Zero Gravity односно функција на нулта гравитација (од 160 до 180 степени) за максимална релаксација. Зафаќа минимален простор и нуди USB полнење за удобно користење.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Паметно скенирање на рамениците, точна масажа, флексибилна реверзна технологија – синхронизирано месење и тапкање, напреден Strech режим – Тајландски стил на мост, напреден систем за скенирање на телото.",
    headOnSubtitleBottom:
      "СОЗДАДЕТЕ STRESS-FREE ЗОНА ВО ВАШИОТ ДЕЛОВЕН ПРОСТОР",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "Повеќе Програми - 3 Интензитети",
    sideDesc:
      "Прецизна масажа, синхронизирано масирање и тапкање, напреден режим на истегнување. Столицата е дизајнирана да се обликува според телото и рамената на корисникот, обезбедувајќи целосна поддршка и удобност.",
    sideIcons: ["hand.png", 'neck.png', 'shoulder.png', 'chair-front-line.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Функцијата за нула гравитација во автоматските масажни столици (160-180 степени) нуди уникатно искуство на релаксација. Со Zero Gravity функцијата, вашето тело се наоѓа во идеален агол кој минимизира притисок на 'рбетниот столб и зголемува удобноста. Оваа положба создава чувство на безтежинска состојба, што го поттикнува длабокото опуштање и максимално намалување на стресот, додека масажата делува на најдобар можен начин. Чувствувајте ја магијата на нулта гравитација и уживајте во целосна релаксација.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "Vending - 130A столицата за масажа е наменета за деловни простори, спа центри, хотели, бензински пумпи, молови и слично. Истата работи по принцип на токени.",
        info2:
          "Vending - 130A напреден ролер за стопала, шиљести ролери кои ќе вршат TuIna масажа на вашите нозе. Проширен одмор за нозе со различни висински опсези – нога -90 мм, автоматски одмор за нозе 170 мм, графенска технологија за загревање за грб, нозе и колена.",
          info3: "Vending столицата за мазажа е достапна веднаш и тоа исклучиво во црна боја.",
          info4: "Цена: 2,180.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 122cm x 76cm x 120cm",
          "Моторни делови: 5",
          "Воздушни перничиња: 16",
          "Материјали: Кожа",
          "Тежина: 78кг",
          "Електричен напој: 120W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "Токен",
          "5 Програми",
          "3 Интензитети",
          "Stretch режим",
          "Zero Gravity",
          "Airbags",
          "Tuina Масажа",
          "Скенирање на рамениците и телото",
        ],
      },
    },
  },
  // {
  //   id: 3,
  //   name: "BL-4",
  //   subTitle: "супериорно масажно искуство",
  //   price: 1558,
  //   availability: false,
  //   colorVariants: [{colorCode: '#695D5F', colorName: 'Кафеава'}],
  //   listItemDesc: [
  //     "SL Лента - 135цм, Ролери за Стапала",
  //     "45°C - Греење на грб и листови",
  //     "20 Airbags - Zero Gravity - Bluetooth",
  //     "10 модови - 3 интензитети",
  //     "Прилагодување кон телото на корисникот",
  //   ],
  //   gallery: {
  //     product: "/chairs/BL-130A/BL-130A_Product.png",
  //     headOn: "/chairs/BL-130A/BL-130A-Front.png",
  //     side: "/chairs/BL-130A/BL-130A_Side.png",
  //     zeroGravity: "/chairs/BL-130A/BL-Z130A_ZeroGrav.png",
  //     detailsHero: "/chairs/BL-130A/BL-130A_Product.png",
  //   },
  //   headOnIcons: ['furniture.png', 'person.png', 'skin-care.png', 'user-interface.png'],
  //   headOnSubTitle: "супериорно масажно искуство",
  //   headOnTitle: "Врвен Дизајн",
  //   headOnDesc:
  //     "Автоматски масажен стол BL-130A нуди врвно релаксирачко искуство со SL Лента од 135 см и ролери за стапала, овозможувајќи длабока и целосна масажа. Со греење на грбот и листовите до 45°C, ќе уживате во топлина која ги опушта мускулите. Столот е опремен со 20 воздушни перничиња, Zero Gravity функција, и Bluetooth, создавајќи комфор и забава. Изберете од 10 модови и 3 интензитети, и дозволете му на столот да се прилагоди на вашето тело за персонализирано уживање. Овој стол е совршен избор за оние кои бараат комбинација од напредни технологии и врвна удобност.",
  //   headOnTitle2: "Интелигентна технологија за прилагодување",
  //   headOnDesc2:
  //     "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
  //   headOnSubtitleBottom:
  //     "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
  //   sideSubTitle: "Уметник За обликување за вашето тело",
  //   sideTitle: "10 програми - 3 Интензитети",
  //   sideDesc:
  //     "Повеќе од 10 различни масажни функции, секоја со различни нивоа на интензитет, овозможувајќи целосно персонализирано искуство. Столот е опремен со 20 воздушни перничиња кои обезбедуваат детална масажа на телото, додека ролерите за листови и стапала гарантираат длабока и ослободувачка масажа. Покрај тоа, функцијата за истегнување придонесува за намалување на мускулната напнатост и подобрување на флексибилноста, правејќи го овој стол совршен за целосна релаксација и терапевтско уживање.",
  //   sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
  //   zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
  //   zeroGravtitle: "ZERO GRAVITY",
  //   zeroGravDesc:
  //     "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
  //   specs: {
  //     info: {
  //       title: "Инфо",
  //       info1:
  //         "BL-4 столицатa е идеалнa за луѓе кои бараат врвно релаксирачко искуство во својот дом, вила, викендица. BL-4 столицатa е идеалнa за луѓе кои придаваат значење на самогрижата и благосостојбата, како професионалци што треба да се опуштат по долг работен ден, лица со активен животен стил кои имаат потреба од опоравување на мускулите, или секој што вреднува напредна технологија во комбинација со удобност.",
  //       info2:
  //         "Дополнително BL-4 столицата е наменета за оние со болки во грбот или стапалата, како и сите кои сакаат да го збогатат својот простор за релаксација со функции како нулта гравитација, загревање и прилагодлива масажа, ќе го најдат овој стол како совршена инвестиција.",
  //         info3: "BL-4 столицата за мазажа е достапна веднаш и тоа исклучиво во Кафеава боја.",
  //         info4: "Цена: 1,558.00€ + ДДВ."
  //     },
  //     techSpecs: {
  //       title: "Технички Спецификации",
  //       funcs: [
  //         "Димензии: 122cm x 76cm x 120cm",
  //         "Моторни делови: 5",
  //         "Воздушни перничиња: 20",
  //         "Материјали: Вештачка Кожа, Метал, Пластика",
  //         "Тежина: 84кг",
  //         "Електричен напој: 120W",
  //       ],
  //     },
  //     functions: {
  //       title: "Функции",
  //       funcs: [
  //         "10 Програми",
  //         "3 Интензитети",
  //         "Греење на грб - 45°C",
  //         "Ролери за листови и стапала",
  //         "Stretch режим",
  //         "Zero Gravity",
  //         "Airbags",
  //         "Tuina Масажа",
  //         "Скенирање на рамениците и телото",
  //       ],
  //     },
  //   },
  // },
  // {
  //   id: 4,
  //   name: "BL-3",
  //   subTitle: "Бескрајни режими на релаксација",
  //   price: 1230,
  //   availability: false,
  //   colorVariants: [{colorCode: '#4C4C56', colorName: 'Black'}],
  //   listItemDesc: [
  //     "2D манипулација - 20 Airbags",
  //     "Ролери за стапала - Греење на половица и листови до 45°C",
  //     "10 модови - 3 интензитети",
  //     "Прилагодување кон формата на тело и рамениците",
  //     "Bluetooth - USB - Zero Gravity - Stretch",
  //   ],
  //   gallery: {
  //     product: "/chairs/BL-160A/BL-160A_Product.png",
  //     headOn: "/chairs/BL-160A/BL-160A_Front.png",
  //     side: "/chairs/BL-160A/BL-160A_Head.png",
  //     zeroGravity: "/chairs/BL-160A/BL-160A_Gravity.png",
  //     detailsHero: "/chairs/BL-160A/BL-160A_Details.png",
  //   },
  //   headOnIcons: ['furniture.png', 'skin-care.png', 'bluetooth.png', 'usb.png',  'user-interface.png'],
  //   headOnSubTitle: "Длабока масажа - Бескрајни режими на релаксација",
  //   headOnTitle: "Врвен Дизајн",
  //   headOnDesc:
  //     "Овој масажен стол со 2D манипулација и 20 воздушни перничиња е создаден да ви обезбеди совршена релаксација. Ролерите за стапала и греењето на половината и листовите до 45°C овозможуваат длабока терапија за ослободување од напрегањето и стресот. Со 10 масажни модови и 3 нивоа на интензитет, столот се прилагодува на вашите потреби и овозможува персонализирано искуство. Дополнително, неговата способност за прилагодување кон формата на вашето тело и рамената ви овозможува максимален комфор. Овој стол е совршен за оние кои сакаат целосна грижа, со функции како Bluetooth, USB, Zero Gravity и Stretch, кои ги задоволуваат сите ваши релаксациони и технолошки потреби.",
  //   headOnTitle2: "Интелигентна технологија за прилагодување",
  //   headOnDesc2:
  //     "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
  //   headOnSubtitleBottom:
  //     "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
  //   sideSubTitle: "Уметник За обликување за вашето тело",
  //   sideTitle: "10 програми - 3 Интензитети",
  //   sideDesc:
  //     "Повеќе од 10 различни масажни функции, секоја со различни нивоа на интензитет, овозможувајќи целосно персонализирано искуство. Столот е опремен со 20 воздушни перничиња кои обезбедуваат детална масажа на телото, додека ролерите за листови и стапала гарантираат длабока и ослободувачка масажа. Покрај тоа, функцијата за истегнување придонесува за намалување на мускулната напнатост и подобрување на флексибилноста, правејќи го овој стол совршен за целосна релаксација и терапевтско уживање.",
  //   sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
  //   zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
  //   zeroGravtitle: "ZERO GRAVITY",
  //   zeroGravDesc:
  //     "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
  //   specs: {
  //     info: {
  //       title: "Инфо",
  //       info1:
  //         "BL-3 столицатa е идеалнa за луѓе кои бараат врвно релаксирачко искуство во својот дом, вила, викендица. BL-3 столицатa е идеалнa за луѓе кои придаваат значење на самогрижата и благосостојбата, како професионалци што треба да се опуштат по долг работен ден, лица со активен животен стил кои имаат потреба од опоравување на мускулите, или секој што вреднува напредна технологија во комбинација со удобност. ",
  //       info2:
  //         "Дополнително BL-3 столицата е наменета за оние со болки во грбот или стапалата, како и сите кои сакаат да го збогатат својот простор за релаксација со функции како нулта гравитација, загревање и прилагодлива масажа, ќе го најдат овој стол како совршена инвестиција.",
  //         info3: "BL-3 столицата за мазажа е достапна веднаш и тоа исклучиво во црна боја.",
  //         info4: "Цена: 1,230.00€ + ДДВ."
  //     },
  //     techSpecs: {
  //       title: "Технички Спецификации",
  //       funcs: [
  //         "Димензии: 117cm x 74cm x 109cm",
  //         "Моторни делови: 6",
  //         "Воздушни перничиња: 20",
  //         "Тежина: 71кг",
  //         "Електричен напој: 120W",
  //         'USB Полнење',
  //         "Bluetooth",
  //         'LCD Екран',
  //         "Материјали: Вештачка Кожа, Метал, Пластика"
  //       ],
  //     },
  //     functions: {
  //       title: "Функции",
  //       funcs: [
  //         "2D Манипулација",
  //         "10 Програми",
  //         "3 Интензитети",
  //         "Греење на грб - 45°C",
  //         "Ролери за листови и стапала",
  //         "Stretch режим",
  //         "Zero Gravity",
  //         "Airbags",
  //         "Tuina Масажа",
  //         "Скенирање на рамениците и телото"
  //       ],
  //     },
  //   },
  // },
  // {
  //   id: 5,
  //   name: "BL-1",
  //   subTitle: "Масажна Столица со U-Shape Перница",
  //   price: 950,
  //   availability: true,
  //   colorVariants: [{colorCode: '#E5CDC5', colorName: 'Златна/Крем'}],
  //   listItemDesc: [
  //     "Airbags - 3 интензитети на стисок",
  //     "Греење на грб и листови до 45°C",
  //     "Ролери за стапала и задница",
  //     "3 модови - 3 интензитети",
  //     "LCD Екран",
  //   ],
  //   gallery: {
  //     product: "/chairs/BL-Z66/Z66_Product.png",
  //     headOn: "/chairs/BL-Z66/Z66_frontview.png",
  //     side: "/chairs/BL-Z66/BL_Z66_Speaker.png",
  //     zeroGravity: "/chairs/BL-Z66/Z66_Gravity.png",
  //     detailsHero: "/chairs/BL-Z66/Z66_Product.png",
  //   },
  //   headOnIcons: ['furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
  //   headOnSubTitle: "Масажна Столица со U-Shape Перница",
  //   headOnTitle: "Врвен Дизајн",
  //   headOnDesc:
  //     "BL-1 масажната столица е совршен избор за сите кои сакаат да уживаат во врвно релаксирачко искуство. Со воздушни перничиња со 3 нивоа на стисок, тој обезбедува прецизна масажа, додека греењето на грбот и листовите до 45°C нуди дополнителна удобност. Ролерите за стапалата и задницата овозможуваат длабока масажа на критичните точки, а со 3 модови и 3 интензитети, столот се прилагодува на вашите потреби. Луксузниот LCD екран овозможува лесно управување, а U-облик перницата на врвот обезбедува совршена поддршка за вашата глава и врат.",
  //   headOnTitle2: "Интелигентна технологија за прилагодување",
  //   headOnDesc2:
  //     "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
  //   headOnSubtitleBottom:
  //     "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
  //   sideSubTitle: "Уметник За обликување за вашето тело",
  //   sideTitle: "3 Автомаски Модови - 3 Интензитети",
  //   sideDesc:
  //     "Овој масажен стол нуди три автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на три одделни интензитети, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
  //   sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
  //   zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
  //   zeroGravtitle: "ZERO GRAVITY",
  //   zeroGravDesc:
  //     "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
  //   specs: {
  //     info: {
  //       title: "Инфо",
  //       info1:
  //         "BL-1 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со три автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
  //       info2:
  //         "Со BL-1 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
  //         info3: "BL-1 столицата за мазажа е достапна веднаш и тоа исклучиво во Златна/Крем боја.",
  //         info4: "Цена: 950.00€ + ДДВ."
  //     },
  //     techSpecs: {
  //       title: "Технички Спецификации",
  //       funcs: [
  //         "Димензии: 112cm x 74cm x 106cm",
  //         "Моторни делови: 5",
  //         "Воздушни перничиња: 18",
  //         "Материјали: Вештачка Кожа",
  //         "Тежина: 56кг",
  //         "Електричен напој: 90W",
  //       ],
  //     },
  //     functions: {
  //       title: "Функции",
  //       funcs: [
  //         "3 Auto Програми",
  //         "3 Интензитети",
  //         "Греење на половица - 45°C",
  //         "Греење на листови - 45°C",
  //         "Ролери за задница и стапала",
  //         "Stretch режим",
  //         "Zero Gravity - 160°",
  //         "Airbags",
  //         "Скенирање на рамениците и телото",
  //       ],
  //     },
  //   },
  // },
  // {
  //   id: 6,
  //   name: "BL-2",
  //   subTitle: "Масажна Столица со U-Shape Перница",
  //   price: 1050,
  //   availability: true,
  //   colorVariants: [{colorCode: '#4C4C56', colorName: 'Црна'}],
  //   listItemDesc: [
  //     "Airbags - 3 интензитети на стисок",
  //     "Греење на грб и листови до 45°C",
  //     "Ролери за стапала и задница",
  //     "4 модови - 3 интензитети",
  //     "LCD Екран - USB Полнење",
  //   ],
  //   gallery: {
  //     product: "/chairs/Z69/Z69_Product.png",
  //     headOn: "/chairs/Z69/Z69_Head.png",
  //     side: "/chairs/Z69/Z69_Details.png",
  //     zeroGravity: "/chairs/Z69/Z69_Grav.png",
  //     detailsHero: "/chairs/Z69/Z69_Details.png",
  //   },
  //   headOnIcons: ['furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
  //   headOnSubTitle: "Масажна Столица со U-Shape Перница",
  //   headOnTitle: "Врвен Дизајн",
  //   headOnDesc:
  //     "BL-2 масажната столица е совршен избор за сите кои сакаат да уживаат во врвно релаксирачко искуство. Со воздушни перничиња со 3 нивоа на стисок, тој обезбедува прецизна масажа, додека греењето на грбот и листовите до 45°C нуди дополнителна удобност. Ролерите за стапалата и задницата овозможуваат длабока масажа на критичните точки, а со 3 модови и 3 интензитети, столот се прилагодува на вашите потреби. Луксузниот LCD екран овозможува лесно управување, а U-облик перницата на врвот обезбедува совршена поддршка за вашата глава и врат.",
  //   headOnTitle2: "Интелигентна технологија за прилагодување",
  //   headOnDesc2:
  //     "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
  //   headOnSubtitleBottom:
  //     "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
  //   sideSubTitle: "Уметник За обликување за вашето тело",
  //   sideTitle: "4 Автомаски Модови - 3 Интензитети",
  //   sideDesc:
  //     "Овој масажен стол нуди три автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на три одделни интензитети, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
  //   sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
  //   zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
  //   zeroGravtitle: "ZERO GRAVITY",
  //   zeroGravDesc:
  //     "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
  //   specs: {
  //     info: {
  //       title: "Инфо",
  //       info1:
  //         "BL-2 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со три автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
  //       info2:
  //         "Со BL-2 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
  //         info3: "BL-2 столицата за мазажа е достапна веднаш и тоа исклучиво во црна боја.",
  //         info4: "Цена: 1,050.00€ + ДДВ."
  //     },
  //     techSpecs: {
  //       title: "Технички Спецификации",
  //       funcs: [
  //         "Димензии: 112cm x 74cm x 106cm",
  //         "Моторни делови: 5",
  //         "Воздушни перничиња: 22",
  //         "Материјали: Вештачка Кожа",
  //         "Тежина: 55кг",
  //         "Електричен напој: 90W",
  //       ],
  //     },
  //     functions: {
  //       title: "Функции",
  //       funcs: [
  //         "4 Auto Програми",
  //         "3 Интензитети",
  //         "Греење на половица - 45°C",
  //         "Греење на листови - 45°C",
  //         "Ролери за задница и стапала",
  //         "Stretch режим",
  //         "Zero Gravity - 160°",
  //         "Airbags",
  //         "Скенирање на рамениците и телото",
  //       ],
  //     },
  //   },
  // },
  {
    id: 8,
    name: "BL-7",
    subTitle: "Масажна Столица ",
    price: 1610,
    availability: true,
    colorVariants: [{colorCode: '#E5E5E5', colorName: 'Бела'}, {colorCode: '#3A434D', colorName: 'Црна'}],
    listItemDesc: [
      "20 Airbags - 3 интензитети",
      "Греење на грб до 45°C",
      "Ролери за стапала",
      "LCD Екран - Wireless Charging - Bluetooth",
      "Zero Gravity",
    ],
    gallery: {
      product: "/chairs/BL-7/BL7_Product.png",
      headOn: "/chairs/BL-7/BL7_Head.png",
      side: "/chairs/BL-7/BL7_Details2.png",
      zeroGravity: "/chairs/BL-7/BL7_Side.png",
      detailsHero: "/chairs/BL-7/BL7_Product.png",
    },
    headOnIcons: ['furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
    headOnSubTitle: "Масажна столица за домашни услови",
    headOnTitle: "Модерен Дизајн",
    headOnDesc:
      "BL-7 масажната столица е совршен избор за сите оние кои сакаат да уживаат во врвно релаксирачко искуство и притоа да го збогатат својот дом со луксузно и модерно парче технологија. Со воздушни перничиња со 3 нивоа на стисок, тој обезбедува прецизна масажа, додека греењето на грбот и листовите до 45°C нуди дополнителна удобност. Ролерите за стапалата овозможуваат длабока масажа на критичните точки, а со повеќето модови и 6 интензитети, столот се прилагодува на вашите потреби. LCD екранот заедно со Bluetooth звучниот систем нуди одлично релаксирачко искуство, кое преку лесните команди можете лесно да го прилагодите според вашите вкусови.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Овој масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ЗБОГУВАТЕ СЕ СО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "Повеќе Автомаски Модови - 3 Интензитети",
    sideDesc:
      "Овој масажен стол нуди пет автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на шест одделни интензитети, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
    sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-7 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со пет автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
        info2:
          "Со BL-7 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
          info3: "BL-7 столицата за мазажа е достапна веднаш и тоа исклучиво во црна и бела варијанта.",
          info4: "Цена: 1,610.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 178cm x 76cm x 85cm",
          "Моторни делови: 6",
          "Воздушни перничиња: 20",
          "Материјали: Вештачка Кожа",
          "Тежина: 93кг",
          "Електричен напој: 135W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "Auto Програми",
          "3D Манипулатор",
          "3 Интензитети",
          "Греење на грб - 45°C",
          "Stretch режим",
          "Zero Gravity",
          "20 Airbags",
          "Скенирање на рамениците и телото",
        ],
      },
    },
  },
  {
    id: 7,
    name: "BL-6",
    subTitle: "Масажна Столица ",
    price: 1520,
    availability: true,
    colorVariants: [{colorCode: '#4C4C56', colorName: 'Црна'},{colorCode: '#E5ECEE', colorName: 'Бело - Сива'}],
    listItemDesc: [
      "Airbags - 5 модови - 6 интензитети",
      "Греење на грб и листови до 45°C",
      "Ролери за стапала",
      "LCD Екран - USB Полнење - Bluetooth",
      "Zero Gravity",
    ],
    gallery: {
      product: "/chairs/BL-6/BL6_Product.png",
      headOn: "/chairs/BL-6/BL6_Head.png",
      side: "/chairs/BL-6/BL6_Side.png",
      zeroGravity: "/chairs/BL-6/BL6_Grav.png",
      detailsHero: "/chairs/BL-6/BL6_Details.png",
    },
    headOnIcons: ['furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
    headOnSubTitle: "Масажна Столица со U-Shape Перница",
    headOnTitle: "Модерен Дизајн",
    headOnDesc:
      "BL-6 масажната столица е совршен избор за сите оние кои сакаат да уживаат во врвно релаксирачко искуство и притоа да го збогатат својот дом со луксузно и модерно парче технологија. Со воздушни перничиња со 6 нивоа на стисок, тој обезбедува прецизна масажа, додека греењето на грбот и листовите до 45°C нуди дополнителна удобност. Ролерите за стапалата овозможуваат длабока масажа на критичните точки, а со 5-те модови и 6 интензитети, столот се прилагодува на вашите потреби. LCD екранот заедно со Bluetooth звучниот систем нуди одлично релаксирачко искуство, кое преку лесните команди можете лесно да го прилагодите според вашите вкусови.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ЗБОГУВАТЕ СЕ СО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "5 Автомаски Модови - 6 Интензитети",
    sideDesc:
      "Овој масажен стол нуди пет автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на шест одделни интензитети, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
    sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-6 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со пет автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
        info2:
          "Со BL-6 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
          info3: "BL-6 столицата за мазажа е достапна веднаш и тоа исклучиво во црна и бела варијанта.",
          info4: "Цена: 1,520.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 143cm x 79cm x 114cm",
          "Моторни делови: 7",
          "Воздушни перничиња: 52",
          "Материјали: Вештачка Кожа",
          "Тежина: 118кг",
          "Електричен напој: 120W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "5 Auto Програми",
          "6 Интензитети",
          "Греење на грб - 45°C",
          "Греење на нозе - 45°C",
          "Ролери за задница и стапала",
          "Stretch режим",
          "Zero Gravity",
          "52 Airbags",
          "Скенирање на рамениците и телото",
        ],
      },
    },
  },
  {
    id: 9,
    name: "BL-8",
    subTitle: "Масажна Столица ",
    price: 2100,
    availability: true,
    colorVariants: [{colorCode: '#4C4C56', colorName: 'Црно - Сива'}, {colorCode: '#CAB197', colorName: 'Кафеаво - Бела'}],
    listItemDesc: [
      "AI детекција на форма на тело",
      "18 модови - 6 техники",
      "Греење на грб до 45°C",
      "Истегнување на нозе",
      "LCD Екран - Bluetooth HIFI Звук",
      "Zero Gravity",
    ],
    gallery: {
      product: "/chairs/BL-8/BL8_Product.png",
      headOn: "/chairs/BL-8/BL8_Head.png",
      side: "/chairs/BL-8/BL8_Side.png",
      zeroGravity: "/chairs/BL-8/BL8_Zero.png",
      detailsHero: "/chairs/BL-8/BL8_Product.png",
    },
    headOnIcons: ['furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
    headOnSubTitle: "Луксузна столица за домашни услови",
    headOnTitle: "Модерен Дизајн",
    headOnDesc:
      "BL-8 масажната столица е совршен избор за сите оние кои сакаат да уживаат во врвно релаксирачко искуство и притоа да го збогатат својот дом со луксузно и модерно парче технологија. Со помош на вештачка интелегенција столицата се прилагодува на телото на корисникот со што обезбедува прецизна масажа, додека греењето на грбот до 45°C нуди и дополнителна удобност. Ролерите и воздушните перничиња овозможуваат длабока масажа на критичните точки, а со 18-те модови и 6 масажни техники, столицата ве допира и на најскриените точки на вашето тело. LCD екранот заедно со Bluetooth звучниот систем нуди одлично релаксирачко искуство, кое преку лесните команди можете лесно да го прилагодите според вашите вкусови.",
    headOnTitle2: "AI технологија за прилагодување",
    headOnDesc2:
      "Овој луксузен масажен стол користи вештачка технологија AI со која го скенира вашето тело, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ЗБОГУВАТЕ СЕ СО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник за обликување за вашето тело",
    sideTitle: "18 Автомаски Модови - 6 Техники",
    sideDesc:
      "Овој масажен стол нуди пет автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на повечето техники, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
    sideIcons: ["back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-8 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со 18 автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
        info2:
          "Со BL-8 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
          info3: "BL-8 столицата за мазажа е достапна веднаш и тоа исклучиво во црна и бела-крем варијанта.",
          info4: "Цена: 2,100.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 125cm x 77cm x 88cm",
          "Моторни делови: 11",
          "Воздушни перничиња: 30",
          "Материјали: Вештачка Кожа",
          "Тежина: 5104кг",
          "Електричен напој: 150W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "18 Auto Програми",
          "6 Техники",
          "Греење на грб - 45°C",
          "Греење на нозе - 45°C",
          "Ролери за задница и стапала",
          "Stretch режим",
          "Zero Gravity",
          "30 Airbags",
          "Скенирање на рамениците и телото",
        ],
      },
    },
  },
  {
    id: 10,
    name: "BL-9",
    subTitle: "Премиум Масажна Столица ",
    price: 4100,
    availability: false,
    colorVariants: [{colorCode: '#2d6161', colorName: 'Зелено - Бела'} ,{colorCode: '#B9A091', colorName: 'Портокалово - Бела'}],
    listItemDesc: [
      "AI детекција на форма на тело - 4D Манипулација",
      "41 модови - 10+ техники",
      "Греење на грб до 45°C",
      "Истегнување на нозе - Ролери на стапала",
      "LCD Екран - Bluetooth HIFI Звук",
      "Zero Gravity",
    ],
    gallery: {
      product: "/chairs/BL-9/BL9_Product.png",
      headOn: "/chairs/BL-9/BL9_Head.png", 
      side: "/chairs/BL-9/BL9_Side.png",
      zeroGravity: "/chairs/BL-9/BL9_Zero.png",
      detailsHero: "/chairs/BL-9/BL9_Zero.png",
    },
    headOnIcons: ["chat-bot.png", "cinema-4d.png",'furniture.png', 'skin-care.png', 'plug-and-play.png',  'user-interface.png'],
    headOnSubTitle: "Луксузна столица за домашни услови",
    headOnTitle: "Уникатен - Футуристички Дизајн",
    headOnDesc:
      "BL-9 е најлуксузната масажна столица во нашиот каталог и е совршен избор за сите оние кои сакаат да уживаат во врвно релаксирачко искуство и притоа да го збогатат својот дом со луксузно и модерно парче технологија. Со помош на вештачка интелегенција и 4D манипулација столицата се прилагодува на телото на корисникот со што обезбедува прецизна масажа, додека греењето на грбот до 45°C нуди и дополнителна удобност. Ролерите и воздушните перничиња овозможуваат длабока масажа на критичните точки, а со 41-те модови столицата ве допира и на најскриените точки на вашето тело. LCD екранот заедно со Bluetooth звучниот систем нуди одлично релаксирачко искуство, кое преку лесните команди можете лесно да го прилагодите според вашите вкусови.",
    headOnTitle2: "AI технологија за прилагодување",
    headOnDesc2:
      "Овој луксузен масажен стол користи вештачка технологија AI со која го скенира вашето тело, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ЗБОГУВАТЕ СЕ СО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник за обликување за вашето тело",
    sideTitle: "41 Автомаски Модови - 10+ Техники",
    sideDesc:
      "Овој масажен стол нуди 41 автоматски режими, секој од нив дизајниран да одговори на различни потреби за релаксација и терапија. Со можност за избор на повечето техники, столот ви овозможува да ја прилагодите масажата според вашите преференции. Без разлика дали сакате нежна масажа за смирување на телото, среден интензитет за ослободување на мускулното напрегање, или длабока терапевтска масажа за опоравување, овој стол ќе ви го обезбеди токму тоа.",
    sideIcons: ["cinema-4d.png", "back.png", 'neck.png', 'shoulder.png', 'hand.png', 'foot.png'],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-9 е совршен за оние што бараат персонализирана грижа во удобноста на својот дом. Со 41 автоматски режими, секој со посебни интензитети, столот овозможува избор што одговара на вашите потреби – од нежна релаксација до длабока терапија.",
        info2:
          "Со BL-9 нема повеќе потреба од скапи масажи – овој стол ќе ви ги донесе професионалните третмани директно во вашата дневна соба. Инвестирајте во своето здравје и добросостојба и дозволете му на овој масажен стол да стане ваш секојдневен извор на релаксација и удобност.",
          info3: "BL-9 столицата за мазажа е достапна веднаш и тоа исклучиво во портокалово-бела и бело-зелена варијанта.",
          info4: "Цена: 4,100.00€ + ДДВ."
      },
      techSpecs: {
        title: "Технички Спецификации",
        funcs: [
          "Димензии: 161cm x 80cm x 156cm",
          "Моторни делови: 15",
          "Воздушни перничиња: 48",
          "Материјали: Медицински силикон - Пластика - Вештачка кожа",
          "Тежина: 120кг",
          "Електричен напој: 105W",
        ],
      },
      functions: {
        title: "Функции",
        funcs: [
          "AI скенирање на телото",
          "41 Auto Програми",
          "10+ Интензитети",
          "Греење на грб - 45°C",
          "Греење на нозе - 45°C",
          "Ролери за задница и стапала",
          "Stretch режим",
          "Zero Gravity",
          "48 Airbags",
        ],
      },
    },
  },
];
