import { MassageChairType } from "@/types/Types";

export const massageChairs: MassageChairType[] = [
  {
    id: 1,
    name: "BL-H530",
    subTitle: "Луксузна Столица за Масажа",
    listItemDesc: [
      "4D манипулација - Масажа на целото тело, ролери за раце, нозе и стапала",
      "48 Воздушни Перничиња - Греење на грб до 45°C",
      "Разни масажи, брзини и интензитети",
      "Детекција на форма на тело",
      "Безжично полнење - Bluetooth - AI гласовни команди",
    ],
    gallery: {
      product: "/chairs/BL-H530/H5305_Product_Blue.png",
      headOn: "/chairs/BL-H530/h530headOn2.png",
      side: "/chairs/BL-H530/530Side2.png",
      zeroGravity: "/chairs/BL-H530/H5303Zero2.png",
      detailsHero: "/chairs/BL-H530/H5305_Product_Blue.png",
    },
    headOnIcons: [""],
    headOnSubTitle: "Луксузна Столица за Масажа",
    headOnTitle: "Врвен Дизајн",
    headOnDesc:
      "Луксузната BL-H530 масажна столица обезбедува највисоко ниво на релаксација и удобност со 4D манипулација за целосна масажа на телото. Воздушните перничиња се грижат за прецизна масажа на рацете и нозете, додека ролерите нудат интензивна масажа на стапалата. Загревањето на грбот до 45 степени дополнително го подобрува искуството. Столот интелигентно го детектира обликот на телото и се прилагодува за персонализирана масажа. Луксузната BL-H530 масажна столица вклучува и безжично полнење, Hi-Fi Bluetooth звук и елегантен LCD екран за максимална контрола и уживање. Оваа столица е идеален избор за оние кои бараат совршена комбинација од релаксација и терапевтска масажа, со посебен акцент на целосното тело и листовите.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Овој луксузен масажен стол е дизајниран да се обликува според телото на корисникот, обезбедувајќи прецизна масажа за максимална релаксација. Благодарение на неговата способност да го истегнува телото и листовите, столот го намалува напрегањето и го подобрува чувството на леснотија. Со функциите за масирање и тапкање, се обезбедува длабока и прецизна масажа на критичните точки на телото и се постигнува ефект на вистинска масажа, како да е изведена од професионален масер.",
    headOnSubtitleBottom:
      "ОТФРЛЕТЕ ГО СТРЕСОТ И ЗАМОРОТ БЕЗ ДА ЈА НАПУШТИТЕ ВАШАТА ДНЕВНА СОБА",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "Повеќе Програми - 3 Интензитети",
    sideDesc:
      "Повеќе од 20 различни масажни функции, секоја со различни нивоа на интензитет, овозможувајќи целосно персонализирано искуство. Столот е опремен со над 48 воздушни перничиња кои обезбедуваат детална масажа на телото, додека ролерите за листови и стапала гарантираат длабока и ослободувачка масажа. Покрај тоа, функцијата за истегнување придонесува за намалување на мускулната напнатост и подобрување на флексибилноста, правејќи го овој стол совршен за целосна релаксација и терапевтско уживање.",
    sideIcons: [""],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Zero Gravity функцијата е дизајнирана да го постави телото во позиција каде што ногата и грбот се во совршена рамнотежа, намалувајќи го притисокот врз 'рбетот и зглобовите. Оваа позиција ја симулира состојбата на безтежинска состојба, што овозможува подобра циркулација на крвта, намалување на стресот и опуштање на мускулите. Како резултат на тоа, функцијата нулта гравитација овозможува длабока релаксација и подобрување на целокупното здравје, претворајќи го секое користење на столот во терапевтско искуство.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "BL-H530 столицата за масажа е идеален избор за оние кои бараат совршена комбинација од релаксација и терапевтска масажа, со посебен акцент на целосното тело и листовите.",
        info2:
          "Со повеќе од 20 масажни функции, прецизна масажа, истегнување и Zero Gravity функцијата, како и компактни димензии и современи технологии како безжично полнење и Bluetooth го прават идеален за секој дом.",
      },
      techSpecs: {
        title: 'Функции',
        funcs: ["Димензии: 184cmx77cmx83cm", 'Моторни делови: 11', "Воздушни перничиња: 48", 'Материјали: Вештачка Кожа', "Тежина: 118кг", 'Електричен напој: 150W']
      },
      functions: {
        title: 'Функции',
        funcs: ["20+ Програми", '3 Интензитети', "Греење на грб - 45°C", "Ролери за листови и стапала","Stretch режим", 'Zero Gravity', "Airbags", 'Tuina Масажа' , "Скенирање на рамениците и телото"]
      },
    },
  },
  {
    id: 2,
    name: "Vending",
    subTitle: "Комерцијална Столица за Масажа",
    listItemDesc: [
      "4D манипулација - Масажа на целото тело",
      "Воздушни Перничиња - Греење на грб до 45°C",
      "Разновидни операции",
      "Детекција на форма на тело",
      "Безжично полнење, HI-FI Bluetooth аудио",
    ],
    gallery: {
      product: "/chairs/Vending/vending_Product_Original.png",
      headOn: "/chairs/Vending/vending_front.png",
      side: "/chairs/Vending/vending_side_Image.png",
      zeroGravity: "/chairs/Vending/vending_gravity (1).png",
      detailsHero: "/chairs/Vending/vending_Details.png",
    },
    headOnIcons: [""],
    headOnSubTitle: "Масажна Столица за Комерцијална употреба",
    headOnTitle: "Врвен Дизајн",
    headOnDesc:
      "Автоматскиот масажен стол за комерцијална употреба е идеален за различни јавни простори. Овaa столица располага со воздушни перничиња за рамена, грб, раце и листови и нуди три нивоа за зголемување на интензитетот на масажата. Се прилагодува на телесната големина на корисникот и го регулира аголот на потпирачот за грб. Дополнително на располагање ви стои и Zero Gravity односно функција на нулта гравитација (од 160 до 180 степени) за максимална релаксација. Зафаќа минимален простор и нуди USB полнење за удобно користење.",
    headOnTitle2: "Интелигентна технологија за прилагодување",
    headOnDesc2:
      "Паметно скенирање на рамениците, точна масажа, флексибилна реверзна технологија – синхронизирано месење и тапкање, напреден Strech режим – Тајландски стил на мост, напреден систем за скенирање на телото.",
    headOnSubtitleBottom:
      "СОЗДАДЕТЕ STRESS-FREE ЗОНА ВО ВАШИОТ ДЕЛОВЕН ПРОСТОР",
    sideSubTitle: "Уметник За обликување за вашето тело",
    sideTitle: "Повеќе Програми - 3 Интензитети",
    sideDesc:
      "Прецизна масажа, синхронизирано масирање и тапкање, напреден режим на истегнување. Столицата е дизајнирана да се обликува според телото и рамената на корисникот, обезбедувајќи целосна поддршка и удобност.",
    sideIcons: [""],
    zeroGravSubTitle: "Уживајте во чувство на бестежинска состојба",
    zeroGravtitle: "ZERO GRAVITY",
    zeroGravDesc:
      "Функцијата за нула гравитација во автоматските масажни столици (160-180 степени) нуди уникатно искуство на релаксација. Со Zero Gravity функцијата, вашето тело се наоѓа во идеален агол кој минимизира притисок на 'рбетниот столб и зголемува удобноста. Оваа положба создава чувство на безтежинска состојба, што го поттикнува длабокото опуштање и максимално намалување на стресот, додека масажата делува на најдобар можен начин. Чувствувајте ја магијата на нулта гравитација и уживајте во целосна релаксација.",
    specs: {
      info: {
        title: "Инфо",
        info1:
          "Vending - 130A столицата за масажа е наменета за деловни простори, спа центри, хотели, бензински пумпи, молови и слично.",
        info2:
          "Vending - 130A напреден ролер за стопала, шиљести ролери кои ќе вршат TuIna масажа на вашите нозе. Проширен одмор за нозе со различни висински опсези – нога -90 мм, автоматски одмор за нозе 170 мм, графенска технологија за загревање за грб, нозе и колена.",
      },
      techSpecs: {
        title: 'Функции',
        funcs: ["Димензии: 122cmx76cmx120cm", 'Моторни делови: 5', "Воздушни перничиња: 16", 'Материјали: Кожа', "Тежина: 78кг", 'Електричен напој: 120W']
      },
      functions: {
        title: 'Функции',
        funcs: ["5 Програми", '3 Интензитети', "Stretch режим", 'Zero Gravity', "Airbags", 'Tuina Масажа' , "Скенирање на рамениците и телото"]
      },
    },
  },
  {
    id: 3,
    name: "BL-130A",
    subTitle: "Луксузна Столица за Масажа",
    listItemDesc: [
      "SL Лента - 135цм, Ролери за Стапала",
      "45°C - Греење на грб и листови",
      "20 Airbags - Zero Gravity - Bluetooth",
      "10 модови - 3 интензитети",
      "Прилагодување кон телото на корисникот",
    ],
    gallery: {
      product: "/chairs/BL-130A/BL-130A_Product.png",
      headOn: "/chairs/BL-130A/BL_H530_Front.png",
      side: "/chairs/BL-130A/BL-130A_Side.png",
      zeroGravity: "/chairs/BL-130A/Vending_Zero-Grav.png",
      detailsHero: "/chairs/Vending/vending_Details.png",
    },
    headOnIcons: [""],
    headOnSubTitle: "",
    headOnTitle: "",
    headOnDesc: "",
    headOnTitle2: "",
    headOnDesc2: "",
    headOnSubtitleBottom: "",
    sideSubTitle: "",
    sideTitle: "",
    sideDesc: "",
    sideIcons: [""],
    zeroGravSubTitle: "",
    zeroGravtitle: "",
    zeroGravDesc: "",
    specs: {
      info: {},
      functions: {},
      techSpecs: {},
    },
  },
  {
    id: 4,
    name: "BL-160A",
    subTitle: "Луксузна Столица за Масажа",
    listItemDesc: [
      "2D манипулација - 20 Airbags",
      "Ролери за стапала - Греење на половица и листови до 45°C",
      "10 модови - 3 интензитети",
      "Прилагодување кон формата на тело и рамениците",
      "HI-FI Bluetooth - Zero Gravity - Stretch (Истегнување)",
    ],
    gallery: {
      product: "/chairs/BL-160A/BL-160A_Product.png",
      headOn: "/chairs/BL-130A/BL_H530_Front.png",
      side: "/chairs/BL-130A/BL-130A_Side.png",
      zeroGravity: "/chairs/BL-130A/Vending_Zero-Grav.png",
      detailsHero: "/chairs/Vending/vending_Details.png",
    },
    headOnIcons: [""],
    headOnSubTitle: "",
    headOnTitle: "",
    headOnDesc: "",
    headOnTitle2: "",
    headOnDesc2: "",
    headOnSubtitleBottom: "",
    sideSubTitle: "",
    sideTitle: "",
    sideDesc: "",
    sideIcons: [""],
    zeroGravSubTitle: "",
    zeroGravtitle: "",
    zeroGravDesc: "",
    specs: {
      info: {},
      functions: {},
      techSpecs: {},
    },
  },
  {
    id: 5,
    name: "BL-Z66",
    subTitle: "Масажен стол со 'U-облик' перница",
    listItemDesc: [
      "Airbags - 3 интензитети на стисок",
      "Греење на грб и листови до 45°C",
      "Ролери за стапала и задница",
      "3 модови - 3 интензитети",
      "LCD Екран",
    ],
    gallery: {
      product: "/chairs/Z66/Z66_Product.png",
      headOn: "/chairs/Z66/Z66_Front.png",
      side: "/chairs/Z66/Z66_Side.png",
      zeroGravity: "/chairs/Z66/Z66_Grav.png",
      detailsHero: "/chairs/Vending/vending_Details.png",
    },
    headOnIcons: [""],
    headOnSubTitle: "",
    headOnTitle: "",
    headOnDesc: "",
    headOnTitle2: "",
    headOnDesc2: "",
    headOnSubtitleBottom: "",
    sideSubTitle: "",
    sideTitle: "",
    sideDesc: "",
    sideIcons: [""],
    zeroGravSubTitle: "",
    zeroGravtitle: "",
    zeroGravDesc: "",
    specs: {
      info: {},
      functions: {},
      techSpecs: {},
    },
  },
];
